In [132]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [133]:
df.shape

(887, 8)

In [134]:
sex = 'male'
p_class = 2
df.Survived.value_counts()

0    545
1    342
Name: Survived, dtype: int64

In [135]:
###EDA

###<li> Learn about odds of surival (deceased/survived) for given gender and class

In [136]:
df.Sex.value_counts()

male      573
female    314
Name: Sex, dtype: int64

In [137]:
pclassdf = df[df.Pclass==p_class]
pclassdf.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
9,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,14.0,1,0,30.0708
15,1,2,Mrs. (Mary D Kingcome) Hewlett,female,55.0,0,0,16.0000
17,1,2,Mr. Charles Eugene Williams,male,23.0,0,0,13.0000
20,0,2,Mr. Joseph J Fynney,male,35.0,0,0,26.0000
21,1,2,Mr. Lawrence Beesley,male,34.0,0,0,13.0000

In [138]:
maledf = df[df.Sex==sex]
maledf.head(10)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
5,0,3,Mr. James Moran,male,27.0,0,0,8.4583
6,0,1,Mr. Timothy J McCarthy,male,54.0,0,0,51.8625
7,0,3,Master. Gosta Leonard Palsson,male,2.0,3,1,21.0750
12,0,3,Mr. William Henry Saundercock,male,20.0,0,0,8.0500
13,0,3,Mr. Anders Johan Andersson,male,39.0,1,5,31.2750
16,0,3,Master. Eugene Rice,male,2.0,4,1,29.1250
17,1,2,Mr. Charles Eugene Williams,male,23.0,0,0,13.0000
20,0,2,Mr. Joseph J Fynney,male,35.0,0,0,26.0000

In [139]:
male_pclass_df = maledf[maledf.Pclass==1]
male_pclass_df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
6,0,1,Mr. Timothy J McCarthy,male,54.0,0,0,51.8625
23,1,1,Mr. William Thompson Sloper,male,28.0,0,0,35.5000
27,0,1,Mr. Charles Alexander Fortune,male,19.0,3,2,263.0000
30,0,1,Don. Manuel E Uruchurtu,male,40.0,0,0,27.7208
34,0,1,Mr. Edgar Joseph Meyer,male,28.0,1,0,82.1708

In [140]:
male_pclass_df.Survived.value_counts()

0    77
1    45
Name: Survived, dtype: int64

In [146]:
not_survived = int(male_pclass_df.Survived.value_counts()[0])

In [147]:
survived = int(male_pclass_df.Survived.value_counts()[1])

In [148]:
print (not_survived)

77

In [150]:
print (survived/not_survived)

0.5844155844155844